// SPDX-License-Identifier: MIT
pragma solidity ^0.8.0;

contract MagicNum {
    address public solver;

    constructor() {}

    function setSolver(address _solver) public {
        solver = _solver;
    }

    /*
    ____________/\\\_______/\\\\\\\\\_____        
     __________/\\\\\_____/\\\///////\\\___       
      ________/\\\/\\\____\///______\//\\\__      
       ______/\\\/\/\\\______________/\\\/___     
        ____/\\\/__\/\\\___________/\\\//_____    
         __/\\\\\\\\\\\\\\\\_____/\\\//________   
          _\///////////\\\//____/\\\/___________  
           ___________\/\\\_____/\\\\\\\\\\\\\\\_ 
            ___________\///_____\///////////////__
    */
}

/** 要通过这个关卡，你只需要向 Ethernaut 提供一个Solver合约，其对whatIsTheMeaningOfLife()能够返回正确的 32 字节的响应。

容易吧？ 嗯。。。有一个问题。

Solver的代码必须非常小，小到最多只能 10 bytes。

提示：是时候离开 solidity 的舒适区了，应该自己手动构建一个编译器了 O_o。 没错，就是原始的 EVM 字节码。

祝你好运！ */